#include "func.h"

int main() {
    srand(time(0));
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // описание игры и дальнейших действий
    // ......

    // Объявление переменных
    //.......

    //Начало цикла игры{
        // Ввод буквы
        // Проверка введенной буквы на корректность

        // Анализ буквы и исходного слова
        // ......
        // Проверка условий выйгрыша/пройгрыша
        // ......  
    // Конец циклa игры}

    // Конечный вывод
    // .......
}